Revit 2026 API
Document.Delete Method
Overload List
Name | Description
Delete(ElementId) |  Deletes an element from the document given the id of that element.
Delete(ICollection<ElementId>)
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace